app/views/recipes/show.html.haml

SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = ?  [["recipe_id", 3]]
---
  %tbody
    -@recipe.reviews.each do |r|