app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
    def index
        # to access all recipes in the view
        # the following line throws uninitialized constant RecipesController::Recipe
        @recipes = Recipe.all

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 1]]
---
    def show
        @recipe = Recipe.find(params[:id])
        if user_signed_in?
            @user = current_user # to be passed into show view
            # user just favorited recipe
            if params[:favorited]
                @user.favorite_recipes << Recipe.where(:id => params[:id]) # adds the newly favorited recipe to the favorite recipes of that user
                @favorited = true
            # user just unfavorited recipe
            elsif params[:unfavorited] && ! (@user.favorite_recipes.where("recipe_id == ?", params[:id]).empty?)
                @user.favorite_recipes.delete(params[:id])
                @favorited = false
                params[:unfavorited] = false
            # user has previously favorited this recipe
            elsif ! (@user.favorite_recipes.where("recipe_id == ?", params[:id]).empty?)

INSERT INTO "recipes" ("recipe_name", "meal_type", "vegan", "vegetarian", "nut_free", "dairy_free", "cuisine", "appliance", "instructions", "ingredients", "time_to_create", "level", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @recipe= Recipe.new(create_update_params)
        @recipe= current_user.recipes.build(create_update_params) #!!!!!
        @recipe.user = current_user
        if @recipe.save

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @recipe = Recipe.find(params[:id]) # get existing object

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "recipes" SET "level" = ?, "instructions" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["level", "Easy"], ["instructions", "make 12"], ["updated_at", "2019-04-05 20:14:24.989362"], ["id", 1]]
---
    def update
        @recipe= Recipe.find(params[:id])
        if @recipe.update(create_update_params) #successful!